gsandi/esp32-kid-learning-arcade/sdkconfig.defaults
# sdkconfig.defaults — kid_arcade ESP32-P4 (CrowPanel 7" MIPI DSI)
#
# Applied by ESP-IDF build system before the project's sdkconfig.
# Only override defaults that differ from IDF's esp32p4 baseline.
# Do NOT set values here that are board-agnostic; let IDF choose them.

# ── Target ────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"

# ── Chip revision ─────────────────────────────────────────────────────────────
# CrowPanel uses ESP32-P4 eco2 (rev 1.x) — select rev < 3 memory layout
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
# Rev < 3 max CPU is 360 MHz (not 400); explicitly select to avoid default 400
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# ── PSRAM (Hex, 200 MHz) ──────────────────────────────────────────────────────
# CrowPanel P4 uses HEX-mode PSRAM at 200 MHz (confirmed from Elecrow reference).
# OCT/80MHz was wrong — mismatched mode causes cache writeback to hang.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# ── L2 cache ──────────────────────────────────────────────────────────────────
CONFIG_CACHE_L2_CACHE_128KB=y
CONFIG_CACHE_L2_CACHE_LINE_64B=y

# ── MIPI DSI ──────────────────────────────────────────────────────────────────
# ISR handler in IRAM so it runs uninterrupted during flash cache misses.
CONFIG_LCD_DSI_ISR_IRAM_SAFE=y

# ── FreeRTOS ──────────────────────────────────────────────────────────────────
# 1 kHz tick for smooth LVGL animation (default 100 Hz is too coarse).
CONFIG_FREERTOS_HZ=1000

# ── Logging ───────────────────────────────────────────────────────────────────
# Reduce log noise in production; change to DEBUG when troubleshooting.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ── Stack sizes ───────────────────────────────────────────────────────────────
# LVGL task needs a larger stack when drawing complex screens.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ── WiFi (ESP-Hosted via ESP32-C6 coprocessor over SDIO) ──────────────────────
# CrowPanel P4: C6 connected on SDIO bus, 1-bit mode, RST on GPIO32
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=32
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_1_BIT_BUS=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_SLOT=1
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=1
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RESET_DELAY_MS=1500
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
CONFIG_ESP_HOSTED_USE_MEMPOOL=y
# Disable IRAM opts to avoid IRAM section conflicts with display driver
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# ── esp_wifi_remote (remote WiFi via ESP-Hosted) ───────────────────────────────
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_WIFI_REMOTE_EAP_ENABLED=y

# ── WIFI_RMT buffers (required by esp_wifi_remote injected headers) ────────────
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_WIFI_RMT_STATIC_TX_BUFFER=y
CONFIG_WIFI_RMT_TX_BUFFER_TYPE=0
CONFIG_WIFI_RMT_STATIC_TX_BUFFER_NUM=16
CONFIG_WIFI_RMT_CACHE_TX_BUFFER_NUM=32
CONFIG_WIFI_RMT_STATIC_RX_MGMT_BUFFER=y
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUF=0
CONFIG_WIFI_RMT_RX_MGMT_BUF_NUM_DEF=5
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=6
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=16
CONFIG_WIFI_RMT_NVS_ENABLED=y
CONFIG_WIFI_RMT_SOFTAP_BEACON_MAX_LEN=752
CONFIG_WIFI_RMT_MGMT_SBUF_NUM=32
CONFIG_WIFI_RMT_ESPNOW_MAX_ENCRYPT_NUM=7

# ── LVGL fonts ────────────────────────────────────────────────────────────────
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
